IDEA Open Model
HingeElement1D.HingeTypeRZ Property
Compatible with IDEA StatiCa v 10.1
 Hinge type in dirrection round Z
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public HingeTypeInDirrection HingeTypeRZ { get; set; }
Public Property HingeTypeRZ As HingeTypeInDirrection
	Get
	Set
public:
property HingeTypeInDirrection HingeTypeRZ {
	HingeTypeInDirrection get ();
	void set (HingeTypeInDirrection value);
}
Property Value
Type: HingeTypeInDirrection
See Also
Reference
HingeElement1D Class
IdeaRS.OpenModel.Model Namespace